{
  "profile": {
    "name": "Adedayo Akinade",
    "label": "",
    "image": "",
    "email": "adedayo.akinade@monash.edu",
    "phone": "(234) 816-375-1034",
    "url": "https://adedayoakinade.github.io/",
    "summary": "",
    "location": {
      "address": "Carnegie Mellon University Africa",
      "postalCode": "",
      "city": "Kigali",
      "countryCode": "RW",
      "region": "Rwanda"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "Akinade_Adedayo",
        "url": "https://twitter.com/Akinade_Adedayo"
      }
    ]
  },
  "work Experience": [
    {
      "name": "Monash University",
      "position": "Teaching Associate",
      "url": "https://www.monash.edu/engineering/",
      "startDate": "2025-06-25",
      "endDate": "Present",
      "summary": "Intelligent Robotics and Engineering Design Courses"
    },
    {
      "name": "Robotics Lab, Monash University",
      "position": "Research Assistant",
      "url": "https://www.monash.edu/engineering/robotics/",
      "startDate": "2025-02-18",
      "endDate": "Present",
      "summary": "",
      "highlights": ["Robot Manipulation, Reinforcement Learning", "Soft Robotics"]
    },
    {
      "name": "AI & Robotics Lab, Carnegie Mellon University",
      "position": "Research Associate",
      "url": "https://www.africa.engineering.cmu.edu/",
      "startDate": "2023-09-01",
      "endDate": "2025-06-30",
      "summary": "",
      "highlights": ["Systems Integration, Robotics Software Devlopment, Computer Vision", "Human Robot Interaction"]
    },
    {
      "name": "BioRobotics Lab, Swiss Federal Technology Institute of Lausanne",
      "position": "Research Assistant",
      "url": "https://www.epfl.ch/labs/biorob/",
      "startDate": "2023-08-28",
      "endDate": "2023-06-01",
      "summary": "An Open Torque-Controlled Modular Robot Architecture for Legged Locomotion Research",
      "highlights": ["Embedded Systems, Firmware Development, Reinforecement Learning"]
    }
  ],
  "volunteer": [
  ],
  "education": [
    {
      "institution": "Carnegie Mellon University",
      "location": "Pittsburgh, USA",
      "url": "https://www.africa.engineering.cmu.edu/",
      "area": "Electrical and Computer Engineering - Advanced Study",
      "studyType": "M.Sc.",
      "startDate": "2022-08-28",
      "endDate": "2024-05-12",
      "score": "10",
      "courses": ["Robotics", "Machine Learning", "Reinforcement Learning", "Computer Vision", "Embedded Systems"]
    },
    {
      "institution": "Federal University of Agriculture, Abeokuta",
      "location": "Abeokuta, Nigeria",
      "url": "https://funaab.edu.ng/",
      "area": "Mechatronics Engineering",
      "studyType": "B.Eng.",
      "startDate": "2014-12-02",
      "endDate": "2021-01-07",
      "score": "10",
      "courses": ["Robotics", "Control", "Digital Systems", "Automation", "Embedded Systems"]
    }
  ],
  "awards": [
    {
      "title": "Award of Excellence, Overall Best Graduating Student",
      "date": "2021-05-14",
      "awarder": "College of Engineering, Federal University of Agriculture, Abeokuta",
      "url": "https://funaab.edu.ng/section/college-of-engineering/",
      "summary": "The award is given to the overall best graduating student (out of 180 students) in the College of Engineering, Federal University of Agriculture, Abeokuta."
    }
  ],
  "certificates": [
    {
      "name": "Project Management Professional (PMP)",
      "date": "2019",
      "issuer": "Seal-Sea Concepts",
      "url": "https://www.seal-seaconcepts.com/",
      "icon": "fa-solid fa-location-dot"
    }
  ],
  "selected Publications": [
    {
      "name": "Biological Motion Aids Gestural Communication by Humanoid Social Robots",
      "publisher": "International Journal of Humanoid Robotics",
      "releaseDate": "2025-01",
      "url": "https://doi.org/10.1142/S021984362550001X",
      "summary": "Advances in social robotics have led to increased interest in designing robots that can communicate effectively with humans through non-verbal gestures. One approach to enhancing the naturalness and expressiveness of robot gestures is to incorporate biological motion, which mimics the velocity and acceleration profiles observed in human gestures. This paper examines the use of biological motion for gestural communication by humanoid social robots, focusing on the impact of biological motion on the perceived warmth and effectiveness of robot gestures in fostering engagement while interacting with these robots. The exercise involved implementing the minimum jerk model of biological motion on a Pepper humanoid social robot and conducting user studies to evaluate the impact of biological motion on human-robot interaction. The results show that incorporating biological motion cues can significantly increase the perceived warmth of robot gestures and improve the overall effectiveness of gestural communication, resulting in more natural and engaging human-robot interaction."
    },
    {
      "name": "Culturally competent social robots target inclusion in Africa",
      "publisher": "Science Robotics",
      "releaseDate": "2023-12-13",
      "url": "https://www.science.org/doi/10.1126/scirobotics.adm7012",
      "summary": "Embedding culturally sensitive body, hand, and facial gestures in social robots will make them more acceptable in Africa."
    },
    {
      "name": "Enhancing the Human-computer Interaction through the Application of Artificial Intelligence, Machine Learning, and Data Mining",
      "publisher": " Betham Books",
      "releaseDate": "2022",
      "url": "https://www.benthamdirect.com/content/books/9789815036398.chap8",
      "summary": "Machines have become an essential part of day-to-day human activities; their volume and frequency of usage have rapidly increased in every sector. These machines, especially the computer system, are well known for their speed, accuracy, repeatability, and use to execute tasks that can be harmful to humans. However, these machines lack intelligence, as they do not possess the ability to think like humans. The quest for producing machines with thinking capabilities led to artificial intelligence; thus, many efforts were channeled towards developing devices that can communicate with their surroundings, making a logical decision on what has been perceived, and then provide the proper solution to the problem. To achieve this feat, machine learning is utilized by subjecting the system to a series of training using algorithms and data mining techniques, which is similar to how humans learn from infancy till adulthood and then execute tasks based on knowledge and the experiences they have gathered growing up. While these technologies opened a creative horizon for technological development, there is a current demand for intelligent user interfaces with high usability that can sustain the mode of interaction depending on users, tasks assigned, and the environment. This chapter attempts to present an overview of how data mining can be incorporated with machine learning to produce a machine with artificial intelligence and how both can improve the intelligent user interface."
    },
    {
      "name": "Development of a real-time framework for farm monitoring using drone technology",
      "publisher": "IAES International Journal of Robotics and Automation",
      "releaseDate": "2020-12",
      "url": "https://de.wikisource.org/wiki/Die_Grundlage_der_allgemeinen_Relativitätstheorie",
      "summary": "This work developed a cost-effective framework for agriculturists to regularly monitor their crops against intruding rodents and other security concerns using modern drone technology through configuration and deployment of an autonomous UAV which also functions as a remotely piloted vehicle. This was done by configuring a quadcopter capable of causing a disturbance when a rodent is observed through an inbuilt alarm system whose sound is amplified to be loud enough to cause the animals to leave the farm area. A framework for real-time image and live video transmission from the farm to a designated remote base station was developed. This was achieved through programming codes that configured the drone to operate an intelligent alarm and object tracking systems which enables a live feed from the UAV using Arduino IDE and Mission Planner for autonomous flight control. The requisite algorithms were developed using the framework of tracking, learning and detection (TLD) in the OpenCV software. The drone movement is equally controlled remotely over a Wi-Fi network using an ESP8266 Wi-Fi module for redirection and controlling of the drone movement to monitor specific locations."
    }
  ],
  "skills": [
    {
      "name": "AI & Robotics",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Computer Vision", 
        "Robot Operating Systems (ROS)",
        "3D CAD/CAM Software",
        "Deep Learning",
        "Printed Circuit Board (PCB) Design"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "AI & Robotics",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Soft Robotics",
        "Robot Manipulation",
        "Human-Robot Interaction",
        "Social Robotics",
        "Reinforcement Learning"
      ]
    }
  ],
  "references": [
  ],
  "projects": [
    {
      "name": "CSSR4Africa – Culturally Sensitive Social Robotics for Africa, 2023-2025 (Ongoing)",
      "summary": "While technological invention creates new ways of doing things, it is innovation that produces social and economic benefits through widespread adoption and the consequent change in the people’s practices. Adoption depends on physical infrastructure, but it also depends on social infrastructure: the conventions that govern people’s behaviour, the practices they find acceptable and unacceptable, and their sense of what is trustworthy. Cultural competence, i.e., an awareness of social norms and cultural expectations, is a key element in fostering this acceptance. The need for technology to be culturally competent is perhaps best exemplified by the field of social robotics, a field that is growing quickly.1 Social robots will serve people in a variety of ways: operating in everyday environments, often in open spaces such as hospitals, exhibition centres, and airports, providing assistance to people, typically in the form of advice, guidance, or information. Loosely based on ethnographic research to acquire cultural knowledge about acceptable modes of communication, the CSSR4Africa project will equip robots with the ability to interact sensitively and politely with people in Africa using spatial, non-verbal, and verbal modes of communication.",
      "highlights": ["Social Robotics", "Cultural Sensitivity"],
      "startDate": "2023-06-01",
      "endDate": "2025-06-30",
      "url": "https://cssr4africa.github.io/"
    }
  ]
}
